/*******************************************************************************/
/*功能: 转换日期为长秒值
/*作者：陈阳
/*create date: 2009-3-19
/*company：geodevice
/******************************************************************************/
#include "jtime.h"


/////////////////////////////////////////////////////////////////////////////
// The one and only application object
#define FIRST_YEAR_CONVERTED 1983
#define LAST_YEAR_CONVERTED 2047
/* Difference in seconds between 1970 and 1984 */
#define SECCOR 441763200

/*from 1970-1983*/
static long Julian_Calendar1[14]={
	0,31536000,63072000,94694400,126230400,
	157766400,189302400,220924800,252460800,
    283996800,315532800,347155200,378691200,410227200};

static long Julian_Calendar[LAST_YEAR_CONVERTED-FIRST_YEAR_CONVERTED+1] =
{
		0, 31622400,  63158400,  94694400, 126230400,
       157852800, 189388800, 220924800, 252460800,
       284083200, 315619200, 347155200, 378691200,
       410313600, 441849600, 473385600, 504921600,
       536544000, 568080000, 599616000, 631152000,
       662774400, 694310400, 725846400, 757382400,
       789004800, 820540800, 852076800, 883612800,
       915235200, 946771200, 978307200,1009843200,
      1041465600,1073001600,1104537600,1136073600,
      1167696000,1199232000,1230768000,1262304000,
      1293926400,1325462400,1356998400,1388534400,
      1420156800,1451692800,1483228800,1514764800,
      1546387200,1577923200,1609459200,1640995200,
      1672617600,1704153600,1735689600,1767225600,
      1798848000,1830384000,1861920000,1893456000,
      1925078400,1956614400,1988150400,2019686400 
};

static short Calendar[13] = { 0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334, 365 } ;

static short Leap_Calendar[13] = { 0, 31, 60, 91, 121, 152, 182, 213, 244, 274, 305, 335, 366 } ;

long longhex (long b)
{
	return b &0xff;
}

long  julian (TIME gt)
{
	long temp ,year;

	year=gt.year;
	if(year>=1900)
		year-=1900;
	if(year + 1899 - FIRST_YEAR_CONVERTED<0)
		temp=Julian_Calendar1[year-70];
	else temp = Julian_Calendar[year + 1899 - FIRST_YEAR_CONVERTED] + SECCOR;
    
	if (isaleap (gt.year))
       temp = temp + (Leap_Calendar[gt.mon - 1] * 86400) ;
    else temp = temp + (Calendar[gt.mon -1] * 86400) ;
    
	temp = temp + (longhex(gt.day - 1) * 86400) + (longhex(gt.hour) * 3600) +
                    (longhex(gt.min) * 60) + longhex(gt.sec) ;
    return temp ;
}
